# Brewfile — `brew bundle install` to install everything
tap "homebrew/cask"
tap "homebrew/core"

# Formulae
brew "a2ps"
brew "agent-browser"
brew "ast-grep"
brew "autoconf"
brew "autoconf-archive"
brew "automake"
brew "bat"
brew "biome"
brew "cairo"
brew "ccache"
brew "cmake"
brew "create-dmg"
brew "curl"
brew "deno"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fmt"
brew "fnm"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "gitui"
brew "go"
brew "harfbuzz"
brew "hf"
brew "lolcat"
brew "neofetch"
brew "ninja"
brew "node"
brew "opencode"
brew "python@3.14"
brew "ripgrep"
brew "sdl2"
brew "sshpass"
brew "swiftformat"
brew "swiftlint"
brew "tailscale"
brew "tmux"
brew "uv"
brew "watch"
brew "wget"
brew "xurls"
brew "yt-dlp"

# Casks
cask "1password"
cask "1password-cli"
cask "alfred"
cask "antigravity"
cask "blender"
cask "choosy"
cask "codex"
cask "codex-app"
cask "codexbar"
cask "dockdoor"
cask "docker-desktop"
cask "figma"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "ghostty"
cask "git-credential-manager"
cask "google-chrome"
cask "intune-company-portal"
cask "lm-studio"
cask "microsoft-edge"
cask "microsoft-teams"
cask "obsidian"
cask "parallels"
cask "raycast"
cask "rocket"
cask "setapp"
cask "shottr"
cask "soundsource"
cask "sublime-text"
cask "tailscale-app"
cask "visual-studio-code@insiders"
cask "xurl"
cask "zed"
